In [2]:
pip install numpy

Collecting numpy
  Using cached numpy-1.24.4-cp38-cp38-win_amd64.whl.metadata (5.6 kB)
Using cached numpy-1.24.4-cp38-cp38-win_amd64.whl (14.9 MB)
Installing collected packages: numpy
Successfully installed numpy-1.24.4
Note: you may need to restart the kernel to use updated packages.

In [3]:
import numpy as np

In [4]:
array1 = np.arange(1, 10)
print(array1)
value = array1[2]
print(value, type(value))

[1 2 3 4 5 6 7 8 9]
3 <class 'numpy.int32'>

In [5]:
print(array1[-1], array1[-2])

9 8

In [6]:
array1 = np.arange(1, 10)
print(array1)
print(type(array1))
array2 = array1[0:3]
print(array2)
print(type(array2))

[1 2 3 4 5 6 7 8 9]
<class 'numpy.ndarray'>
[1 2 3]
<class 'numpy.ndarray'>

In [7]:
array1 = np.arange(1, 10)
print(array1)
array2 = array1[:3]
print(array2)
array3 = array1[3:]
print(array3)
array4 = array1[:]
print(array4)

[1 2 3 4 5 6 7 8 9]
[1 2 3]
[4 5 6 7 8 9]
[1 2 3 4 5 6 7 8 9]

In [8]:
array1 = np.arange(1, 10)
array2 = array1.reshape(3, 3)
print(array2)
print(array2[0:2, 0:2])
print(array2[1:3, 0:3])
print(array2[1:3, :])
print(array2[:, :])
print(array2[:2, 1:])
print(array2[:2, 0])

[[1 2 3]
 [4 5 6]
 [7 8 9]]
[[1 2]
 [4 5]]
[[4 5 6]
 [7 8 9]]
[[4 5 6]
 [7 8 9]]
[[1 2 3]
 [4 5 6]
 [7 8 9]]
[[2 3]
 [5 6]]
[1 4]

In [9]:
array1 = np.arange(1, 10)
array2 = array1.reshape(3, 3)
print(array2)
print(array2[0])
print(array2[1])
print(array2.shape)
print(array2[0].shape)
print(array2[1].shape)

[[1 2 3]
 [4 5 6]
 [7 8 9]]
[1 2 3]
[4 5 6]
(3, 3)
(3,)
(3,)

In [10]:
array1 = np.arange(1, 10)
array2 = array1[array1 > 5]
print(array2)

[6 7 8 9]

In [11]:
print(array1 > 5)

[False False False False False  True  True  True  True]

In [12]:
array1 = np.array([3, 1, 9, 5])
print(array1)
sorted1 = np.sort(array1)[::-1]
print(sorted1)
print(array1)

[3 1 9 5]
[9 5 3 1]
[3 1 9 5]

In [13]:
array2 = np.array([[8, 12],
[7, 1]])
print(array2)
sorted1 = np.sort(array2, axis=0)
print(sorted1)
sorted2 = np.sort(array2, axis=1)
print(sorted2)

[[ 8 12]
 [ 7  1]]
[[ 7  1]
 [ 8 12]]
[[ 8 12]
 [ 1  7]]

In [14]:
array1 = np.array([3, 1, 9, 5])
print(array1)
indices = np.argsort(array1)
print(indices)

[3 1 9 5]
[1 0 3 2]

In [15]:
array1 = np.array([3, 1, 9, 5])
print(array1)
indices = np.argsort(array1)[::-1]
print(indices)

[3 1 9 5]
[2 3 0 1]

In [16]:
array1 = np.array(['John', 'Mike', 'Sarah', 'Kate', 'Samuel'])
array2 = np.array([78, 95, 84, 98, 88])
indices = np.argsort(array2)
print(indices)
print(array1[indices])

[0 2 4 1 3]
['John' 'Sarah' 'Samuel' 'Mike' 'Kate']

In [17]:
A = np.array([[1, 2, 3],
[4, 5, 6]])
B = np.array([[7, 8],
[9, 10],
[11, 12]])
result = np.dot(A, B)
print(A)
print(B)
print(result)

[[1 2 3]
 [4 5 6]]
[[ 7  8]
 [ 9 10]
 [11 12]]
[[ 58  64]
 [139 154]]

In [18]:
A = np.array([[1, 2],
[3, 4]])
result = np.transpose(A)
print(A)
print(result)

[[1 2]
 [3 4]]
[[1 3]
 [2 4]]

In [20]:
pip install pandas

Collecting pandas
  Using cached pandas-2.0.3-cp38-cp38-win_amd64.whl.metadata (18 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\asus\.conda\envs\ml_lecture\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\asus\.conda\envs\ml_lecture\lib\site-packages (from pandas) (2024.1)
Collecting tzdata>=2022.1 (from pandas)
  Using cached tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: numpy>=1.20.3 in c:\users\asus\.conda\envs\ml_lecture\lib\site-packages (from pandas) (1.24.4)
Requirement already satisfied: six>=1.5 in c:\users\asus\.conda\envs\ml_lecture\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Using cached pandas-2.0.3-cp38-cp38-win_amd64.whl (10.8 MB)
Using cached tzdata-2024.1-py2.py3-none-any.whl (345 kB)
Installing collected packages: tzdata, pandas
Successfully installed pandas-2.0.3 tzdata-2024.1
Note: you may need to restart the kernel to use updated packages.

In [21]:
import pandas as pd

In [22]:
import pandas as pd
df = pd.read_csv('c:/Temp/train.csv')
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
df = pd.read_csv('c:/Temp/train.csv')
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [24]:
print(df.shape)

(891, 12)

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [26]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200